app/controllers/collaborators_controller.rb

  def index
    @collaborators = Collaborator.all
---
SELECT "collaborators".* FROM "collaborators"

  def create
    @collaborator = Collaborator.new(collaborator_params)
    @collaborator.save
---
INSERT INTO "collaborators" ("apellidos", "carrera", "created_at", "matricula", "nombre", "statu", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @collaborator.destroy
---
DELETE FROM "collaborators" WHERE "collaborators"."id" = ?  [["id", 1]]

    def set_collaborator
      @collaborator = Collaborator.find(params[:id])
---
SELECT  "collaborators".* FROM "collaborators"  WHERE "collaborators"."id" = ? LIMIT 1  [["id", 1]]