app/controllers/equipment_controller.rb

  def index
    @equipment = Equipment.all
---
SELECT "equipment".* FROM "equipment"