app/controllers/labs_controller.rb

  def index
    @labs = Lab.all
---
SELECT "labs".* FROM "labs"

  def create
    @lab = Lab.new(lab_params)
    @lab.save
---
INSERT INTO "labs" ("colaboradores", "created_at", "equipo", "mobiliario", "nombre", "nomclatura", "profesor_encargado", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_lab
      @lab = Lab.find(params[:id])
---
SELECT  "labs".* FROM "labs"  WHERE "labs"."id" = ? LIMIT 1  [["id", 1]]